explanation-generation/app/controllers/scenarios_controller.rb

SELECT "scenarios".* FROM "scenarios"
---
  def index
    @scenarios = Scenario.all

UPDATE "scenarios" SET "name" = $1, "updated_at" = $2 WHERE "scenarios"."id" = $3  [["name", "Friends trip"], ["updated_at", "2018-06-08 13:26:32.648561"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @scenario.update(scenario_params)

DELETE FROM "scenarios" WHERE "scenarios"."id" = $1  [["id", 1]]
---
  def destroy
    @scenario.destroy

SELECT  "scenarios".* FROM "scenarios" WHERE "scenarios"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_scenario
    @scenario = Scenario.find(params[:id])