explanation-generation/app/views/scenarios/show.html.erb

    <th>Person</th>
    <% @scenario.point_of_interests.each do |poi| %>
---
SELECT "point_of_interests".* FROM "point_of_interests" WHERE "point_of_interests"."scenario_id" = $1  [["scenario_id", 1]]

  <tbody>
  <% @scenario.people.each do |person| %>
---
SELECT "people".* FROM "people" WHERE "people"."scenario_id" = $1  [["scenario_id", 1]]

      <% @scenario.point_of_interests.each do |poi| %>
        <td><%= poi.scores.find_by(person: person)&.score || '-' %></td>
---
SELECT  "scores".* FROM "scores" WHERE "scores"."person_id" = $1 ORDER BY score DESC LIMIT $2  [["person_id", 4], ["LIMIT", 1]]

<h2>Sequences</h2>
<% @scenario.sequences.each do |sequence| %>
---
SELECT "sequences".* FROM "sequences" WHERE "sequences"."scenario_id" = $1  [["scenario_id", 2]]