explanation-generation/app/commands/sequence_strategies/lm_mp_wm_strategy.rb

    def call(scenario:)
      scenario = scenario
      points = scenario.point_of_interests

      # # Without Misery
      points = points.where.not(id: points.joins(:scores).where('scores.score < ?', THRESHOLD).ids)

      # # Calculate Most Pleasure and Least Misery
      # points = points.with_most_pleasure.with_least_misery
      self.sequence = points.joins(:scores)
                            .group(:point_of_interest_id, 'point_of_interests.id')
                            .order('MAX(score) + MIN(score) DESC')

      # Persist sequence
      sequence_json = {}
      sequence_json[:sequence_poi_names] = []
      sequence_json[:sequence_poi_ids] = []
      sequence.each_with_index do |poi, index|
        sequence_json[:sequence_poi_names][index] = poi.name
        sequence_json[:sequence_poi_ids][index] = poi.id
      end
      seq = Sequence.find_or_create_by(scenario: scenario, strategy: STRATEGY)
      seq.update(sequence: sequence_json)
---
SELECT "point_of_interests"."id" FROM "point_of_interests" INNER JOIN "scores" ON "scores"."point_of_interest_id" = "point_of_interests"."id" WHERE "point_of_interests"."scenario_id" = $1 AND (scores.score < 4)  [["scenario_id", 2]]
SELECT "point_of_interests".* FROM "point_of_interests" INNER JOIN "scores" ON "scores"."point_of_interest_id" = "point_of_interests"."id" WHERE "point_of_interests"."scenario_id" = $1 AND "point_of_interests"."id" NOT IN ($2, $3, $4, $5) GROUP BY "point_of_interest_id", point_of_interests.id ORDER BY MAX(score) + MIN(score) DESC  [["scenario_id", 2], ["id", 13], ["id", 11], ["id", 19], ["id", 13]]
INSERT INTO "sequences" ("strategy", "scenario_id") VALUES ($1, $2) RETURNING "id"  [["strategy", "Least Misery + Most Pleasure + Without Misery"], ["scenario_id", 2]]
SELECT  "sequences".* FROM "sequences" WHERE "sequences"."scenario_id" = $1 AND "sequences"."strategy" = $2 LIMIT $3  [["scenario_id", 2], ["strategy", "Least Misery + Most Pleasure + Without Misery"], ["LIMIT", 1]]
UPDATE "sequences" SET "sequence" = $1 WHERE "sequences"."id" = $2  [["sequence", "{\"sequence_poi_names\":[\"E\",\"F\",\"H\",\"D\",\"J\",\"B\",\"G\"],\"sequence_poi_ids\":[15,16,18,14,20,12,17]}"], ["id", 1]]