explanation-generation/app/commands/scenarios/create_task_file.rb

SELECT "people".* FROM "people" WHERE "people"."scenario_id" = $1  [["scenario_id", 2]]
SELECT  "scores".* FROM "scores" WHERE "scores"."person_id" = $1 ORDER BY "scores"."id" ASC LIMIT $2  [["person_id", 4], ["LIMIT", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."person_id" = $1 AND "scores"."id" != $2 ORDER BY "scores"."id" ASC  [["person_id", 4], ["id", 32]]
SELECT  "sequences".* FROM "sequences" WHERE "sequences"."scenario_id" = $1 ORDER BY "sequences"."id" ASC LIMIT $2  [["scenario_id", 2], ["LIMIT", 1]]
---
    def call(scenario:, explanations:)

      filename = DateTime.now.to_s + '-' + scenario.name + '.txt'
      self.file_path = Rails.root.join('task_files', filename)

      File.open(file_path, 'w') do |f|
        scenario.people.each do |person|
          # Name
          f << scenario.name + "\n"
          # Preferences
          f << 'Preferences:'
          first_score = person.scores.order(:id).first
          f << first_score.score.to_s
          person.scores.where.not(id: first_score.id).order(:id).each do |s|
            f << ',' + s.score.to_s
          end
          f << "\n"
          # Sequence
          f << 'Sequence:'
          sequence_names = scenario.sequences.first.sequence["sequence_poi_names"]