explanation-generation/app/views/people/_form.html.erb

  <div style="max-width: 5em;">
    <%= form.simple_fields_for :scores, @person.scores.order(:id) do |s| %>
---
SELECT "scores".* FROM "scores" WHERE "scores"."person_id" = $1 ORDER BY "scores"."id" ASC  [["person_id", 4]]