explanation-generation/app/commands/sequence_explanations/generate_explanation.rb

    def call(sequence:)
      self.scenario = sequence.scenario
      self.points = PointOfInterest.find(sequence.sequence['sequence_poi_ids'])
---
SELECT "point_of_interests".* FROM "point_of_interests" WHERE "point_of_interests"."id" IN ($1, $2, $3, $4, $5, $6, $7)  [["id", 15], ["id", 16], ["id", 18], ["id", 14], ["id", 20], ["id", 12], ["id", 17]]

    def generate_personal_explanation(person)
      person_scores = Score.where(person: person, point_of_interest: points)
      explanation = ''

      person_score = person_scores.sum(&:score)
---
SELECT "scores".* FROM "scores" WHERE "scores"."person_id" = $1 AND "scores"."point_of_interest_id" IN ($2, $3, $4, $5, $6, $7, $8)

    def generate_negative_explanation(person:)
      sentence = ''
      lowest_score = Score.where(person: person, point_of_interest: points).order('score ASC').first
      if lowest_score.score > 5
        ''
      else
        relative_lowest = lowest_score.score.to_f / 10
        sentiment = satisfaction_level(relative_lowest)
        sentence += Dictionary::OPENING_SENTENCES[sentiment].sample
        sentence += lowest_score.point_of_interest.name
        sentence += Dictionary::BEGIN_END_SENTENCES[:but_info].sample.downcase

        other_score = Score.where.not(person: person)
                           .where(point_of_interest: lowest_score.point_of_interest)
                           .order('score DESC')
                           .first
---
SELECT  "scores".* FROM "scores" WHERE "scores"."person_id" = $1 AND "scores"."point_of_interest_id" IN ($2, $3, $4, $5, $6, $7, $8) ORDER BY score ASC LIMIT $9
SELECT  "scores".* FROM "scores" WHERE "scores"."person_id" != $1 AND "scores"."point_of_interest_id" = $2 ORDER BY score DESC LIMIT $3  [["person_id", 4], ["point_of_interest_id", 12], ["LIMIT", 1]]

    def generate_positive_explanation(person:)
      sentence = ''
      highest_score = Score.where(person: person).order('score DESC').first
      favorite_item = highest_score.point_of_interest

      unless points.include?(highest_score.point_of_interest.id)
        sentence += Dictionary::BEGIN_END_SENTENCES[:favorite].sample.gsub('<<NAME>>', favorite_item.name)
        sentence += 'and ' + Dictionary::BEGIN_END_SENTENCES[:not_included].sample
        sentence.strip!
        sentence += Dictionary::BEGIN_END_SENTENCES[:but_info].sample.downcase

        other_score = Score.where.not(person: person).where(point_of_interest: favorite_item).order('score ASC').first
---
SELECT  "scores".* FROM "scores" WHERE "scores"."person_id" = $1 ORDER BY score DESC LIMIT $2  [["person_id", 4], ["LIMIT", 1]]
SELECT  "scores".* FROM "scores" WHERE "scores"."person_id" != $1 AND "scores"."point_of_interest_id" IN ($2, $3, $4, $5, $6, $7, $8) ORDER BY score ASC LIMIT $9
SELECT  "scores".* FROM "scores" WHERE "scores"."person_id" != $1 AND "scores"."point_of_interest_id" = $2 ORDER BY score ASC LIMIT $3  [["person_id", 4], ["point_of_interest_id", 11], ["LIMIT", 1]]